veecle/veecle-pxros/app-tc37x/bsp/uc/uc_tc37/TC37xPD_RegCHeaders/_Reg/IfxEdsadc_regdef.h
/** \brief Modulator Configuration Register ${x}   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_EDSADC_CH_MODCFG_Bits B;      /**< \brief Bitfield access */
} Ifx_EDSADC_CH_MODCFG;

/** \brief Offset Compensation Register ${x}   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_EDSADC_CH_OFFCOMP_Bits B;     /**< \brief Bitfield access */
} Ifx_EDSADC_CH_OFFCOMP;

/** \brief Overshoot Compensation Cfg. Register ${x}   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_EDSADC_CH_OVSCFG_Bits B;      /**< \brief Bitfield access */
} Ifx_EDSADC_CH_OVSCFG;

/** \brief Rectification Configuration Register ${x}   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_EDSADC_CH_RECTCFG_Bits B;     /**< \brief Bitfield access */
} Ifx_EDSADC_CH_RECTCFG;

/** \brief Result Register ${x} Auxiliary   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_EDSADC_CH_RESA_Bits B;        /**< \brief Bitfield access */
} Ifx_EDSADC_CH_RESA;

/** \brief Result Register ${x} Main   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_EDSADC_CH_RESM_Bits B;        /**< \brief Bitfield access */
} Ifx_EDSADC_CH_RESM;

/** \brief Result FIFO Control Register ${x}   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_EDSADC_CH_RFC_Bits B;         /**< \brief Bitfield access */
} Ifx_EDSADC_CH_RFC;

/** \brief Time-Stamp Counter ${x}   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_EDSADC_CH_TSCNT_Bits B;       /**< \brief Bitfield access */
} Ifx_EDSADC_CH_TSCNT;

/** \brief Time-Stamp Register ${x}   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_EDSADC_CH_TSTMP_Bits B;       /**< \brief Bitfield access */
} Ifx_EDSADC_CH_TSTMP;

/** \brief Common Mode Voltage Register ${x}   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_EDSADC_CH_VCM_Bits B;         /**< \brief Bitfield access */
} Ifx_EDSADC_CH_VCM;

/** \brief Clock Control Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_EDSADC_CLC_Bits B;            /**< \brief Bitfield access */
} Ifx_EDSADC_CLC;

/** \brief Event Flag Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_EDSADC_EVFLAG_Bits B;         /**< \brief Bitfield access */
} Ifx_EDSADC_EVFLAG;

/** \brief Event Flag Clear Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_EDSADC_EVFLAGCLR_Bits B;      /**< \brief Bitfield access */
} Ifx_EDSADC_EVFLAGCLR;

/** \brief Global Configuration Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_EDSADC_GLOBCFG_Bits B;        /**< \brief Bitfield access */
} Ifx_EDSADC_GLOBCFG;

/** \brief Global Run Control Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_EDSADC_GLOBRC_Bits B;         /**< \brief Bitfield access */
} Ifx_EDSADC_GLOBRC;

/** \brief Module Identification Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_EDSADC_ID_Bits B;             /**< \brief Bitfield access */
} Ifx_EDSADC_ID;

/** \brief Kernel Reset Register 0   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_EDSADC_KRST0_Bits B;          /**< \brief Bitfield access */
} Ifx_EDSADC_KRST0;

/** \brief Kernel Reset Register 1   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_EDSADC_KRST1_Bits B;          /**< \brief Bitfield access */
} Ifx_EDSADC_KRST1;

/** \brief Kernel Reset Status Clear Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_EDSADC_KRSTCLR_Bits B;        /**< \brief Bitfield access */
} Ifx_EDSADC_KRSTCLR;

/** \brief OCDS Control and Status Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_EDSADC_OCS_Bits B;            /**< \brief Bitfield access */
} Ifx_EDSADC_OCS;

/** \}  */

/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxSfr_Edsadc_CH_struct
 * \{  */
/******************************************************************************/
/** \name Object L1
 * \{  */
/** \brief CH object */
typedef volatile struct _Ifx_EDSADC_CH
{
       Ifx_EDSADC_CH_MODCFG                MODCFG;                 /**< \brief 0, Modulator Configuration Register ${x}*/
       Ifx_UReg_8Bit                       reserved_4[4];          /**< \brief 4, \internal Reserved */
       Ifx_EDSADC_CH_DICFG                 DICFG;                  /**< \brief 8, Demodulator Input Config. Register ${x}*/
       Ifx_UReg_8Bit                       reserved_C[4];          /**< \brief C, \internal Reserved */
       Ifx_EDSADC_CH_FCFGM                 FCFGM;                  /**< \brief 10, Filter Configuration Register ${x}, Main*/
       Ifx_EDSADC_CH_FCFGC                 FCFGC;                  /**< \brief 14, Filter Configuration Register ${x}, CIC Filter*/
       Ifx_EDSADC_CH_FCNTC                 FCNTC;                  /**< \brief 18, Filter Counter Register ${x}, CIC Filter*/
       Ifx_EDSADC_CH_OVSCFG                OVSCFG;                 /**< \brief 1C, Overshoot Compensation Cfg. Register ${x}*/
       Ifx_EDSADC_CH_IWCTR                 IWCTR;                  /**< \brief 20, Integration Window Control Register ${x}*/
       Ifx_EDSADC_CH_IIVAL                 IIVAL;                  /**< \brief 24, Intermediate Integration Value*/
       Ifx_EDSADC_CH_ISTAT                 ISTAT;                  /**< \brief 28, Integrator Status Register ${x}*/
       Ifx_EDSADC_CH_RFC                   RFC;                    /**< \brief 2C, Result FIFO Control Register ${x}*/
       Ifx_EDSADC_CH_RESM                  RESM;                   /**< \brief 30, Result Register ${x} Main*/
       Ifx_UReg_8Bit                       reserved_34[4];         /**< \brief 34, \internal Reserved */
       Ifx_EDSADC_CH_OFFCOMP               OFFCOMP;                /**< \brief 38, Offset Compensation Register ${x}*/
       Ifx_EDSADC_CH_GAINCAL               GAINCAL;                /**< \brief 3C, Gain Calibration Register ${x}*/
       Ifx_EDSADC_CH_GAINCTR               GAINCTR;                /**< \brief 40, Gain Control Register ${x}*/
       Ifx_EDSADC_CH_GAINCORR              GAINCORR;               /**< \brief 44, Gain Correction Register ${x}*/
       Ifx_UReg_8Bit                       reserved_48[8];         /**< \brief 48, \internal Reserved */
       Ifx_EDSADC_CH_TSTMP                 TSTMP;                  /**< \brief 50, Time-Stamp Register ${x}*/
       Ifx_EDSADC_CH_TSCNT                 TSCNT;                  /**< \brief 54, Time-Stamp Counter ${x}*/
       Ifx_UReg_8Bit                       reserved_58[24];        /**< \brief 58, \internal Reserved */
       Ifx_EDSADC_CH_FCFGA                 FCFGA;                  /**< \brief 70, Auxiliary Filter Configuration Register ${x}*/
       Ifx_UReg_8Bit                       reserved_74[4];         /**< \brief 74, \internal Reserved */
       Ifx_EDSADC_CH_BOUNDSEL              BOUNDSEL;               /**< \brief 78, Boundary Select Register ${x}*/
       Ifx_UReg_8Bit                       reserved_7C[4];         /**< \brief 7C, \internal Reserved */
       Ifx_EDSADC_CH_RESA                  RESA;                   /**< \brief 80, Result Register ${x} Auxiliary*/
       Ifx_UReg_8Bit                       reserved_84[28];        /**< \brief 84, \internal Reserved */
       Ifx_EDSADC_CH_CGSYNC                CGSYNC;                 /**< \brief A0, Carrier Generator Synchronization Reg. ${x}*/
       Ifx_UReg_8Bit                       reserved_A4[4];         /**< \brief A4, \internal Reserved */
       Ifx_EDSADC_CH_RECTCFG               RECTCFG;                /**< \brief A8, Rectification Configuration Register ${x}*/
       Ifx_UReg_8Bit                       reserved_AC[4];         /**< \brief AC, \internal Reserved */
       Ifx_EDSADC_CH_VCM                   VCM;                    /**< \brief B0, Common Mode Voltage Register ${x}*/
       Ifx_UReg_8Bit                       reserved_B4[76];        /**< \brief B4, \internal Reserved */
} Ifx_EDSADC_CH;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/

/******************************************************************************/
/** \addtogroup IfxSfr_Edsadc_Registers_struct
 * \{  */
/******************************************************************************/
/** \name Object L0
 * \{  */

/** \brief EDSADC object */
typedef volatile struct _Ifx_EDSADC
{
       Ifx_EDSADC_CLC                      CLC;                    /**< \brief 0, Clock Control Register*/
       Ifx_UReg_8Bit                       reserved_4[4];          /**< \brief 4, \internal Reserved */
       Ifx_EDSADC_ID                       ID;                     /**< \brief 8, Module Identification Register*/
       Ifx_UReg_8Bit                       reserved_C[28];         /**< \brief C, \internal Reserved */
       Ifx_EDSADC_OCS                      OCS;                    /**< \brief 28, OCDS Control and Status Register*/
       Ifx_EDSADC_KRSTCLR                  KRSTCLR;                /**< \brief 2C, Kernel Reset Status Clear Register*/
       Ifx_EDSADC_KRST1                    KRST1;                  /**< \brief 30, Kernel Reset Register 1*/
       Ifx_EDSADC_KRST0                    KRST0;                  /**< \brief 34, Kernel Reset Register 0*/
       Ifx_UReg_8Bit                       reserved_38[4];         /**< \brief 38, \internal Reserved */
       Ifx_EDSADC_ACCEN0                   ACCEN0;                 /**< \brief 3C, Access Enable Register 0*/
       Ifx_UReg_8Bit                       reserved_40[64];        /**< \brief 40, \internal Reserved */
       Ifx_EDSADC_GLOBCFG                  GLOBCFG;                /**< \brief 80, Global Configuration Register*/
       Ifx_UReg_8Bit                       reserved_84[4];         /**< \brief 84, \internal Reserved */
       Ifx_EDSADC_GLOBRC                   GLOBRC;                 /**< \brief 88, Global Run Control Register*/
       Ifx_UReg_8Bit                       reserved_8C[4];         /**< \brief 8C, \internal Reserved */
       Ifx_EDSADC_ACCPROT                  ACCPROT;                /**< \brief 90, Access Protection Register*/
       Ifx_UReg_8Bit                       reserved_94[12];        /**< \brief 94, \internal Reserved */
       Ifx_EDSADC_CGCFG                    CGCFG;                  /**< \brief A0, Carrier Generator Configuration Register*/
       Ifx_UReg_8Bit                       reserved_A4[60];        /**< \brief A4, \internal Reserved */
       Ifx_EDSADC_EVFLAG                   EVFLAG;                 /**< \brief E0, Event Flag Register*/
       Ifx_EDSADC_EVFLAGCLR                EVFLAGCLR;              /**< \brief E4, Event Flag Clear Register*/
       Ifx_UReg_8Bit                       reserved_E8[24];        /**< \brief E8, \internal Reserved */
       Ifx_EDSADC_CH                       CH[6];                  /**< \brief 100, */
       Ifx_UReg_8Bit                       reserved_700[2304];     /**< \brief 700, \internal Reserved */
} Ifx_EDSADC;

/** \}  */
/******************************************************************************/
/** \}  */


/******************************************************************************/

/******************************************************************************/

#endif /* IFXEDSADC_REGDEF_H */
